<!-- 用户使用协议 -->
<template>
    <div class="flex flex-col h-full tlw_top_bg">
        <NavBar transparent :nav-bar-props="{ title: '用户使用协议' }" />
        <div class="flex-1 bg-mainBg rounded-t-20px overflow-y-auto z-0">
            <SwiperBox>
                <ul class="bg-white rounded-20px">
                    <li
                        :key="index"
                        v-for="(item, index) in list"
                        class="border-b border-mainBg px-10px py-4 last-of-type:border-b-0"
                    >
                        <h4 class="text-17px font-bold text-txt mb-2">
                            {{ item.title }}
                        </h4>
                        <ul class="text-13px text-txt_d">
                            <li v-for="(v, i) in item.list" :key="i">
                                <p class="indent-2 mb-2">
                                    {{ v }}
                                </p>
                            </li>
                        </ul>
                    </li>
                </ul>
            </SwiperBox>
        </div>
    </div>
</template>

<script setup lang="ts">
import { ref } from "vue";
import NavBar from "@/components/NavBar.vue";
import SwiperBox from "@/components/SwiperBox.vue";

const APP_NAME = ref<string>(import.meta.env.VITE_APP_NAME);
const list = ref<{ title: string; list: string[] }[]>([
    {
        title: "【账户条例】",
        list: [
            `   1. 用户注册${APP_NAME.value}游戏账户，表示用户已确实详阅、理解并同意${APP_NAME.value}各项使用规范、游戏规则、各项条款且同意自行承担相应的法律责任；如若不同意${APP_NAME.value}任意一项协议、条款、规范的内容，用户应立即停止使用${APP_NAME.value}的各项服务。`,
            `   2. 享受${APP_NAME.value}提供的服务是用户本人意愿，并视为用户理解和接受赢钱和输钱的风险，且其风险由用户自行承担，用户认同${APP_NAME.value}所提供的服务是正常、合理、公正、公平的。`,
            `   3. 用户声明并承诺，用户在注册开户时所提供的资料，包括用户姓名、邮箱地址、电话号码、IP地址，均真实、准确、完整，一但注册，除特殊原因将无法更改。用户注册的游戏账户姓名必须与用户身份证、银行账户一致，若不一致，${APP_NAME.value}将无法提供部分服务。`,
            `   4. 若发现用户以任何不正当的方式登入并参与游戏，${APP_NAME.value}有权拒绝服务该用户，并在不通知的情况下冻结资金或关闭相关游戏账号，不退还任何款项。`,
            `   5. 为避免争议，用户在参与${APP_NAME.value}所有游戏过程中或在结束游戏前，务必检查游戏账号资料，如发现任何异常情况，应立即与客服联系查证，否则视为同意并接受。其账号数据和历史数据，以${APP_NAME.value}资料库的资料为准，用户不得异议。`,
            "   6. 用户拥有超过一个游戏账号，包括同姓名、同一邮箱地址、同一家庭、同一住址、同一借记卡、同一银行账户、同一电脑（大学，团体，网吧，图书馆，办公室等），被将视为联合游戏账号或可疑游戏账号，本网站有权在不通知的情况下冻结或关闭相关游戏账号，并不退还任何款项。",
        ],
    },
    {
        title: "【提款协议】",
        list: [
            "   1. 用户每日最高可申请提款16次（6次免费普通提现、4次大额提现、6次专属提现）",
            "   2. 用户每日最高派彩金额1000万人民币，即所有平台玩法总和的派彩金额。最低提款额度为100元，当日提款额度总额度为180万人民币。",
            `   3. 用户申请提款若遇到配合平台抽查，需全力配合，平台抽查完毕，若无问题，${APP_NAME.value}会于第一时间为用户出款。`,
            "   4. 所有提款申请必须符合本网站的提款政策，如账号有未完成的流水，则无法发起提现，提款申请将会被驳回。",
            "   5. 若有需要，用户必须提供个人资料如身份证副本、驾驶执照副本、银行交易记录截图、居民户口簿副本等资料。",
        ],
    },
    {
        title: "【存款协议】",
        list: [
            "   1. 通过网银自助存款方式的用户，若未依照网站要求填写附言，请及时联系在线客服。温馨提示：若存款人姓名与游戏账户姓名不一致，请配合提供网银电子回单，以便财务人员进行补单。",
            "   2. 第三方支付会有延迟到账的情形，属正常现象。通过第三方支付进行存款的会员，若出现掉单的情况，请及时联系在线客服，并提供订单号、存款金额、存款时间、充值成功截图等资料，以便我们尽快为您补单。",
            `   3. 用户存款前请务必先至${APP_NAME.value}网站确认当下显示的存款账户，并依照${APP_NAME.value}的存款方式操作，若无先行确认当时使用的存款账户而造成的损失，${APP_NAME.value}概不负责。`,
            `   4. 存款最低额度100元，若低于100元，${APP_NAME.value}不提供人工存款相关服务，待用户再次存款补足单笔最低100元额度后，即可联系在线客服完成人工存款相关的服务。`,
        ],
    },
    {
        title: "【优惠条款】",
        list: [
            "   1. 通过网银自助存款方式的用户，若未依照网站要求填写附言，请及时联系在线客服。温馨提示：若存款人姓名与游戏账户姓名不一致，请配合提供网银电子回单，以便财务人员进行补单。",
            `   2. 若用户涉嫌个人或团体以不正当的手法，骗取或诈骗相关优惠奖金，${APP_NAME.value}有权在不通知的情况下冻结或关闭相关账号，并不退还款项，用户将会被列入黑名单，并保留追究权利。`,
            "   3. 用户拥有超过一个账号，包括同一姓名、同一邮箱地址、同一住址、同一借记卡、同一银行账户、同一电脑（大学，团体，网吧，图书馆，办公室等），被视为联合账号或可疑账号。",
            `   4. 一旦发现该用户存在无风险投注或对赌行为，${APP_NAME.value}有权在不通知的情况下冻结或关闭相关账号，并不退还款项，用户将会被列入黑名单，并保留追究权利。`,
            `   5. ${APP_NAME.value}有权根据会员情况调整会员投注限额。${APP_NAME.value}拥有对所有优惠活动在无通知的情况下修改及最终解释的权力。`,
            `   6. ${APP_NAME.value}对以上条例拥有最终解释权。`,
        ],
    },
]);
</script>
